tools/benchmark/results-fetched-50k-1.5kb/results/pg-name-update.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/k6/name-update.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * name_update: 50 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 376 complete and 0 interrupted iterations
name_update   [   0% ] 50 VUs  0m01.0s/5m0s

running (0m02.0s), 50/50 VUs, 898 complete and 0 interrupted iterations
name_update   [   1% ] 50 VUs  0m02.0s/5m0s

running (0m03.0s), 50/50 VUs, 1497 complete and 0 interrupted iterations
name_update   [   1% ] 50 VUs  0m03.0s/5m0s

running (0m04.0s), 50/50 VUs, 2259 complete and 0 interrupted iterations
name_update   [   1% ] 50 VUs  0m04.0s/5m0s

running (0m05.0s), 50/50 VUs, 2416 complete and 0 interrupted iterations
name_update   [   2% ] 50 VUs  0m05.0s/5m0s

running (0m06.0s), 50/50 VUs, 2877 complete and 0 interrupted iterations
name_update   [   2% ] 50 VUs  0m06.0s/5m0s

running (0m07.0s), 50/50 VUs, 3578 complete and 0 interrupted iterations
name_update   [   2% ] 50 VUs  0m07.0s/5m0s

running (0m08.0s), 50/50 VUs, 4295 complete and 0 interrupted iterations
name_update   [   3% ] 50 VUs  0m08.0s/5m0s

running (0m09.0s), 50/50 VUs, 4834 complete and 0 interrupted iterations
name_update   [   3% ] 50 VUs  0m09.0s/5m0s

running (0m10.0s), 50/50 VUs, 5593 complete and 0 interrupted iterations
name_update   [   3% ] 50 VUs  0m10.0s/5m0s

running (0m11.0s), 50/50 VUs, 6374 complete and 0 interrupted iterations
name_update   [   4% ] 50 VUs  0m11.0s/5m0s

running (0m12.0s), 50/50 VUs, 7181 complete and 0 interrupted iterations
name_update   [   4% ] 50 VUs  0m12.0s/5m0s

running (0m13.0s), 50/50 VUs, 7896 complete and 0 interrupted iterations
name_update   [   4% ] 50 VUs  0m13.0s/5m0s

running (0m14.0s), 50/50 VUs, 8660 complete and 0 interrupted iterations
name_update   [   5% ] 50 VUs  0m14.0s/5m0s

running (0m15.0s), 50/50 VUs, 9366 complete and 0 interrupted iterations
name_update   [   5% ] 50 VUs  0m15.0s/5m0s

running (0m16.0s), 50/50 VUs, 10033 complete and 0 interrupted iterations
name_update   [   5% ] 50 VUs  0m16.0s/5m0s

running (0m17.0s), 50/50 VUs, 10802 complete and 0 interrupted iterations
name_update   [   6% ] 50 VUs  0m17.0s/5m0s

running (0m18.0s), 50/50 VUs, 11605 complete and 0 interrupted iterations
name_update   [   6% ] 50 VUs  0m18.0s/5m0s

running (0m19.0s), 50/50 VUs, 12349 complete and 0 interrupted iterations
name_update   [   6% ] 50 VUs  0m19.0s/5m0s

running (0m20.0s), 50/50 VUs, 13165 complete and 0 interrupted iterations
name_update   [   7% ] 50 VUs  0m20.0s/5m0s

running (0m21.0s), 50/50 VUs, 13849 complete and 0 interrupted iterations
name_update   [   7% ] 50 VUs  0m21.0s/5m0s

running (0m22.0s), 50/50 VUs, 14542 complete and 0 interrupted iterations
name_update   [   7% ] 50 VUs  0m22.0s/5m0s

running (0m23.0s), 50/50 VUs, 15362 complete and 0 interrupted iterations
name_update   [   8% ] 50 VUs  0m23.0s/5m0s

running (0m24.0s), 50/50 VUs, 16158 complete and 0 interrupted iterations
name_update   [   8% ] 50 VUs  0m24.0s/5m0s

running (0m25.0s), 50/50 VUs, 16974 complete and 0 interrupted iterations
name_update   [   8% ] 50 VUs  0m25.0s/5m0s

running (0m26.0s), 50/50 VUs, 17662 complete and 0 interrupted iterations
name_update   [   9% ] 50 VUs  0m26.0s/5m0s

running (0m27.0s), 50/50 VUs, 18405 complete and 0 interrupted iterations
name_update   [   9% ] 50 VUs  0m27.0s/5m0s

running (0m28.0s), 50/50 VUs, 19136 complete and 0 interrupted iterations
name_update   [   9% ] 50 VUs  0m28.0s/5m0s

running (0m29.0s), 50/50 VUs, 19934 complete and 0 interrupted iterations
name_update   [  10% ] 50 VUs  0m29.0s/5m0s

running (0m30.0s), 50/50 VUs, 20683 complete and 0 interrupted iterations
name_update   [  10% ] 50 VUs  0m30.0s/5m0s

running (0m31.0s), 50/50 VUs, 21505 complete and 0 interrupted iterations
name_update   [  10% ] 50 VUs  0m31.0s/5m0s

running (0m32.0s), 50/50 VUs, 22286 complete and 0 interrupted iterations
name_update   [  11% ] 50 VUs  0m32.0s/5m0s

running (0m33.0s), 50/50 VUs, 23047 complete and 0 interrupted iterations
name_update   [  11% ] 50 VUs  0m33.0s/5m0s

running (0m34.0s), 50/50 VUs, 23777 complete and 0 interrupted iterations
name_update   [  11% ] 50 VUs  0m34.0s/5m0s

running (0m35.0s), 50/50 VUs, 24471 complete and 0 interrupted iterations
name_update   [  12% ] 50 VUs  0m35.0s/5m0s

running (0m36.0s), 50/50 VUs, 25329 complete and 0 interrupted iterations
name_update   [  12% ] 50 VUs  0m36.0s/5m0s

running (0m37.0s), 50/50 VUs, 26151 complete and 0 interrupted iterations
name_update   [  12% ] 50 VUs  0m37.0s/5m0s

running (0m38.0s), 50/50 VUs, 26956 complete and 0 interrupted iterations
name_update   [  13% ] 50 VUs  0m38.0s/5m0s

running (0m39.0s), 50/50 VUs, 27620 complete and 0 interrupted iterations
name_update   [  13% ] 50 VUs  0m39.0s/5m0s

running (0m40.0s), 50/50 VUs, 28321 complete and 0 interrupted iterations
name_update   [  13% ] 50 VUs  0m40.0s/5m0s

running (0m41.0s), 50/50 VUs, 29167 complete and 0 interrupted iterations
name_update   [  14% ] 50 VUs  0m41.0s/5m0s

running (0m42.0s), 50/50 VUs, 29947 complete and 0 interrupted iterations
name_update   [  14% ] 50 VUs  0m42.0s/5m0s

running (0m43.0s), 50/50 VUs, 30676 complete and 0 interrupted iterations
name_update   [  14% ] 50 VUs  0m43.0s/5m0s

running (0m44.0s), 50/50 VUs, 31523 complete and 0 interrupted iterations
name_update   [  15% ] 50 VUs  0m44.0s/5m0s

running (0m45.0s), 50/50 VUs, 32244 complete and 0 interrupted iterations
name_update   [  15% ] 50 VUs  0m45.0s/5m0s

running (0m46.0s), 50/50 VUs, 33018 complete and 0 interrupted iterations
name_update   [  15% ] 50 VUs  0m46.0s/5m0s

running (0m47.0s), 50/50 VUs, 33798 complete and 0 interrupted iterations
name_update   [  16% ] 50 VUs  0m47.0s/5m0s

running (0m48.0s), 50/50 VUs, 34425 complete and 0 interrupted iterations
name_update   [  16% ] 50 VUs  0m48.0s/5m0s

running (0m49.0s), 50/50 VUs, 35256 complete and 0 interrupted iterations
name_update   [  16% ] 50 VUs  0m49.0s/5m0s

running (0m50.0s), 50/50 VUs, 36087 complete and 0 interrupted iterations
name_update   [  17% ] 50 VUs  0m50.0s/5m0s

running (0m51.0s), 50/50 VUs, 36856 complete and 0 interrupted iterations
name_update   [  17% ] 50 VUs  0m51.0s/5m0s

running (0m52.0s), 50/50 VUs, 37287 complete and 0 interrupted iterations
name_update   [  17% ] 50 VUs  0m52.0s/5m0s

running (0m53.0s), 50/50 VUs, 37921 complete and 0 interrupted iterations
name_update   [  18% ] 50 VUs  0m53.0s/5m0s

running (0m54.0s), 50/50 VUs, 38745 complete and 0 interrupted iterations
name_update   [  18% ] 50 VUs  0m54.0s/5m0s

running (0m55.0s), 50/50 VUs, 39082 complete and 0 interrupted iterations
name_update   [  18% ] 50 VUs  0m55.0s/5m0s

running (0m56.0s), 50/50 VUs, 39097 complete and 0 interrupted iterations
name_update   [  19% ] 50 VUs  0m56.0s/5m0s

running (0m57.0s), 50/50 VUs, 39755 complete and 0 interrupted iterations
name_update   [  19% ] 50 VUs  0m57.0s/5m0s

running (0m58.0s), 50/50 VUs, 40452 complete and 0 interrupted iterations
name_update   [  19% ] 50 VUs  0m58.0s/5m0s

running (0m59.0s), 50/50 VUs, 40989 complete and 0 interrupted iterations
name_update   [  20% ] 50 VUs  0m59.0s/5m0s

running (1m00.0s), 50/50 VUs, 41614 complete and 0 interrupted iterations
name_update   [  20% ] 50 VUs  1m00.0s/5m0s

running (1m01.0s), 50/50 VUs, 42182 complete and 0 interrupted iterations
name_update   [  20% ] 50 VUs  1m01.0s/5m0s

running (1m02.0s), 50/50 VUs, 42788 complete and 0 interrupted iterations
name_update   [  21% ] 50 VUs  1m02.0s/5m0s

running (1m03.0s), 50/50 VUs, 42804 complete and 0 interrupted iterations
name_update   [  21% ] 50 VUs  1m03.0s/5m0s

running (1m04.0s), 50/50 VUs, 43532 complete and 0 interrupted iterations
name_update   [  21% ] 50 VUs  1m04.0s/5m0s

running (1m05.0s), 50/50 VUs, 44128 complete and 0 interrupted iterations
name_update   [  22% ] 50 VUs  1m05.0s/5m0s

running (1m06.0s), 50/50 VUs, 44906 complete and 0 interrupted iterations
name_update   [  22% ] 50 VUs  1m06.0s/5m0s

running (1m07.0s), 50/50 VUs, 45760 complete and 0 interrupted iterations
name_update   [  22% ] 50 VUs  1m07.0s/5m0s

running (1m08.0s), 50/50 VUs, 46592 complete and 0 interrupted iterations
name_update   [  23% ] 50 VUs  1m08.0s/5m0s

running (1m09.0s), 50/50 VUs, 47315 complete and 0 interrupted iterations
name_update   [  23% ] 50 VUs  1m09.0s/5m0s

running (1m10.0s), 50/50 VUs, 48072 complete and 0 interrupted iterations
name_update   [  23% ] 50 VUs  1m10.0s/5m0s

running (1m11.0s), 50/50 VUs, 48729 complete and 0 interrupted iterations
name_update   [  24% ] 50 VUs  1m11.0s/5m0s

running (1m12.0s), 50/50 VUs, 49491 complete and 0 interrupted iterations
name_update   [  24% ] 50 VUs  1m12.0s/5m0s

running (1m13.0s), 50/50 VUs, 50299 complete and 0 interrupted iterations
name_update   [  24% ] 50 VUs  1m13.0s/5m0s

running (1m14.0s), 50/50 VUs, 51032 complete and 0 interrupted iterations
name_update   [  25% ] 50 VUs  1m14.0s/5m0s

running (1m15.0s), 50/50 VUs, 51831 complete and 0 interrupted iterations
name_update   [  25% ] 50 VUs  1m15.0s/5m0s

running (1m16.0s), 50/50 VUs, 52666 complete and 0 interrupted iterations
name_update   [  25% ] 50 VUs  1m16.0s/5m0s

running (1m17.0s), 50/50 VUs, 53380 complete and 0 interrupted iterations
name_update   [  26% ] 50 VUs  1m17.0s/5m0s

running (1m18.0s), 50/50 VUs, 54119 complete and 0 interrupted iterations
name_update   [  26% ] 50 VUs  1m18.0s/5m0s

running (1m19.0s), 50/50 VUs, 54866 complete and 0 interrupted iterations
name_update   [  26% ] 50 VUs  1m19.0s/5m0s

running (1m20.0s), 50/50 VUs, 55695 complete and 0 interrupted iterations
name_update   [  27% ] 50 VUs  1m20.0s/5m0s

running (1m21.0s), 50/50 VUs, 56520 complete and 0 interrupted iterations
name_update   [  27% ] 50 VUs  1m21.0s/5m0s

running (1m22.0s), 50/50 VUs, 57309 complete and 0 interrupted iterations
name_update   [  27% ] 50 VUs  1m22.0s/5m0s

running (1m23.0s), 50/50 VUs, 58108 complete and 0 interrupted iterations
name_update   [  28% ] 50 VUs  1m23.0s/5m0s

running (1m24.0s), 50/50 VUs, 58696 complete and 0 interrupted iterations
name_update   [  28% ] 50 VUs  1m24.0s/5m0s

running (1m25.0s), 50/50 VUs, 59339 complete and 0 interrupted iterations
name_update   [  28% ] 50 VUs  1m25.0s/5m0s

running (1m26.0s), 50/50 VUs, 59678 complete and 0 interrupted iterations
name_update   [  29% ] 50 VUs  1m26.0s/5m0s

running (1m27.0s), 50/50 VUs, 60512 complete and 0 interrupted iterations
name_update   [  29% ] 50 VUs  1m27.0s/5m0s

running (1m28.0s), 50/50 VUs, 61282 complete and 0 interrupted iterations
name_update   [  29% ] 50 VUs  1m28.0s/5m0s

running (1m29.0s), 50/50 VUs, 62013 complete and 0 interrupted iterations
name_update   [  30% ] 50 VUs  1m29.0s/5m0s

running (1m30.0s), 50/50 VUs, 62800 complete and 0 interrupted iterations
name_update   [  30% ] 50 VUs  1m30.0s/5m0s

running (1m31.0s), 50/50 VUs, 63595 complete and 0 interrupted iterations
name_update   [  30% ] 50 VUs  1m31.0s/5m0s

running (1m32.0s), 50/50 VUs, 64319 complete and 0 interrupted iterations
name_update   [  31% ] 50 VUs  1m32.0s/5m0s

running (1m33.0s), 50/50 VUs, 65087 complete and 0 interrupted iterations
name_update   [  31% ] 50 VUs  1m33.0s/5m0s

running (1m34.0s), 50/50 VUs, 65915 complete and 0 interrupted iterations
name_update   [  31% ] 50 VUs  1m34.0s/5m0s

running (1m35.0s), 50/50 VUs, 66705 complete and 0 interrupted iterations
name_update   [  32% ] 50 VUs  1m35.0s/5m0s

running (1m36.0s), 50/50 VUs, 67472 complete and 0 interrupted iterations
name_update   [  32% ] 50 VUs  1m36.0s/5m0s

running (1m37.0s), 50/50 VUs, 68132 complete and 0 interrupted iterations
name_update   [  32% ] 50 VUs  1m37.0s/5m0s

running (1m38.0s), 50/50 VUs, 68944 complete and 0 interrupted iterations
name_update   [  33% ] 50 VUs  1m38.0s/5m0s

running (1m39.0s), 50/50 VUs, 69656 complete and 0 interrupted iterations
name_update   [  33% ] 50 VUs  1m39.0s/5m0s

running (1m40.0s), 50/50 VUs, 70501 complete and 0 interrupted iterations
name_update   [  33% ] 50 VUs  1m40.0s/5m0s

running (1m41.0s), 50/50 VUs, 71355 complete and 0 interrupted iterations
name_update   [  34% ] 50 VUs  1m41.0s/5m0s

running (1m42.0s), 50/50 VUs, 72179 complete and 0 interrupted iterations
name_update   [  34% ] 50 VUs  1m42.0s/5m0s

running (1m43.0s), 50/50 VUs, 72873 complete and 0 interrupted iterations
name_update   [  34% ] 50 VUs  1m43.0s/5m0s

running (1m44.0s), 50/50 VUs, 73565 complete and 0 interrupted iterations
name_update   [  35% ] 50 VUs  1m44.0s/5m0s

running (1m45.0s), 50/50 VUs, 74343 complete and 0 interrupted iterations
name_update   [  35% ] 50 VUs  1m45.0s/5m0s

running (1m46.0s), 50/50 VUs, 75168 complete and 0 interrupted iterations
name_update   [  35% ] 50 VUs  1m46.0s/5m0s

running (1m47.0s), 50/50 VUs, 75964 complete and 0 interrupted iterations
name_update   [  36% ] 50 VUs  1m47.0s/5m0s

running (1m48.0s), 50/50 VUs, 76732 complete and 0 interrupted iterations
name_update   [  36% ] 50 VUs  1m48.0s/5m0s

running (1m49.0s), 50/50 VUs, 77474 complete and 0 interrupted iterations
name_update   [  36% ] 50 VUs  1m49.0s/5m0s

running (1m50.0s), 50/50 VUs, 78194 complete and 0 interrupted iterations
name_update   [  37% ] 50 VUs  1m50.0s/5m0s

running (1m51.0s), 50/50 VUs, 79007 complete and 0 interrupted iterations
name_update   [  37% ] 50 VUs  1m51.0s/5m0s

running (1m52.0s), 50/50 VUs, 79859 complete and 0 interrupted iterations
name_update   [  37% ] 50 VUs  1m52.0s/5m0s

running (1m53.0s), 50/50 VUs, 80713 complete and 0 interrupted iterations
name_update   [  38% ] 50 VUs  1m53.0s/5m0s

running (1m54.0s), 50/50 VUs, 81378 complete and 0 interrupted iterations
name_update   [  38% ] 50 VUs  1m54.0s/5m0s

running (1m55.0s), 50/50 VUs, 82180 complete and 0 interrupted iterations
name_update   [  38% ] 50 VUs  1m55.0s/5m0s

running (1m56.0s), 50/50 VUs, 82872 complete and 0 interrupted iterations
name_update   [  39% ] 50 VUs  1m56.0s/5m0s

running (1m57.0s), 50/50 VUs, 83703 complete and 0 interrupted iterations
name_update   [  39% ] 50 VUs  1m57.0s/5m0s

running (1m58.0s), 50/50 VUs, 84486 complete and 0 interrupted iterations
name_update   [  39% ] 50 VUs  1m58.0s/5m0s

running (1m59.0s), 50/50 VUs, 85201 complete and 0 interrupted iterations
name_update   [  40% ] 50 VUs  1m59.0s/5m0s

running (2m00.0s), 50/50 VUs, 85977 complete and 0 interrupted iterations
name_update   [  40% ] 50 VUs  2m00.0s/5m0s

running (2m01.0s), 50/50 VUs, 86582 complete and 0 interrupted iterations
name_update   [  40% ] 50 VUs  2m01.0s/5m0s

running (2m02.0s), 50/50 VUs, 87317 complete and 0 interrupted iterations
name_update   [  41% ] 50 VUs  2m02.0s/5m0s

running (2m03.0s), 50/50 VUs, 88094 complete and 0 interrupted iterations
name_update   [  41% ] 50 VUs  2m03.0s/5m0s

running (2m04.0s), 50/50 VUs, 88832 complete and 0 interrupted iterations
name_update   [  41% ] 50 VUs  2m04.0s/5m0s

running (2m05.0s), 50/50 VUs, 89635 complete and 0 interrupted iterations
name_update   [  42% ] 50 VUs  2m05.0s/5m0s

running (2m06.0s), 50/50 VUs, 90447 complete and 0 interrupted iterations
name_update   [  42% ] 50 VUs  2m06.0s/5m0s

running (2m07.0s), 50/50 VUs, 91268 complete and 0 interrupted iterations
name_update   [  42% ] 50 VUs  2m07.0s/5m0s

running (2m08.0s), 50/50 VUs, 92033 complete and 0 interrupted iterations
name_update   [  43% ] 50 VUs  2m08.0s/5m0s

running (2m09.0s), 50/50 VUs, 92764 complete and 0 interrupted iterations
name_update   [  43% ] 50 VUs  2m09.0s/5m0s

running (2m10.0s), 50/50 VUs, 93572 complete and 0 interrupted iterations
name_update   [  43% ] 50 VUs  2m10.0s/5m0s

running (2m11.0s), 50/50 VUs, 94344 complete and 0 interrupted iterations
name_update   [  44% ] 50 VUs  2m11.0s/5m0s

running (2m12.0s), 50/50 VUs, 95181 complete and 0 interrupted iterations
name_update   [  44% ] 50 VUs  2m12.0s/5m0s

running (2m13.0s), 50/50 VUs, 95974 complete and 0 interrupted iterations
name_update   [  44% ] 50 VUs  2m13.0s/5m0s

running (2m14.0s), 50/50 VUs, 96740 complete and 0 interrupted iterations
name_update   [  45% ] 50 VUs  2m14.0s/5m0s

running (2m15.0s), 50/50 VUs, 97411 complete and 0 interrupted iterations
name_update   [  45% ] 50 VUs  2m15.0s/5m0s

running (2m16.0s), 50/50 VUs, 98225 complete and 0 interrupted iterations
name_update   [  45% ] 50 VUs  2m16.0s/5m0s

running (2m17.0s), 50/50 VUs, 98973 complete and 0 interrupted iterations
name_update   [  46% ] 50 VUs  2m17.0s/5m0s

running (2m18.0s), 50/50 VUs, 99798 complete and 0 interrupted iterations
name_update   [  46% ] 50 VUs  2m18.0s/5m0s

running (2m19.0s), 50/50 VUs, 100575 complete and 0 interrupted iterations
name_update   [  46% ] 50 VUs  2m19.0s/5m0s

running (2m20.0s), 50/50 VUs, 101228 complete and 0 interrupted iterations
name_update   [  47% ] 50 VUs  2m20.0s/5m0s

running (2m21.0s), 50/50 VUs, 101879 complete and 0 interrupted iterations
name_update   [  47% ] 50 VUs  2m21.0s/5m0s

running (2m22.0s), 50/50 VUs, 102493 complete and 0 interrupted iterations
name_update   [  47% ] 50 VUs  2m22.0s/5m0s

running (2m23.0s), 50/50 VUs, 103205 complete and 0 interrupted iterations
name_update   [  48% ] 50 VUs  2m23.0s/5m0s

running (2m24.0s), 50/50 VUs, 104013 complete and 0 interrupted iterations
name_update   [  48% ] 50 VUs  2m24.0s/5m0s

running (2m25.0s), 50/50 VUs, 104823 complete and 0 interrupted iterations
name_update   [  48% ] 50 VUs  2m25.0s/5m0s

running (2m26.0s), 50/50 VUs, 105633 complete and 0 interrupted iterations
name_update   [  49% ] 50 VUs  2m26.0s/5m0s

running (2m27.0s), 50/50 VUs, 106359 complete and 0 interrupted iterations
name_update   [  49% ] 50 VUs  2m27.0s/5m0s

running (2m28.0s), 50/50 VUs, 107024 complete and 0 interrupted iterations
name_update   [  49% ] 50 VUs  2m28.0s/5m0s

running (2m29.0s), 50/50 VUs, 107836 complete and 0 interrupted iterations
name_update   [  50% ] 50 VUs  2m29.0s/5m0s

running (2m30.0s), 50/50 VUs, 108571 complete and 0 interrupted iterations
name_update   [  50% ] 50 VUs  2m30.0s/5m0s

running (2m31.0s), 50/50 VUs, 109407 complete and 0 interrupted iterations
name_update   [  50% ] 50 VUs  2m31.0s/5m0s

running (2m32.0s), 50/50 VUs, 110268 complete and 0 interrupted iterations
name_update   [  51% ] 50 VUs  2m32.0s/5m0s

running (2m33.0s), 50/50 VUs, 111066 complete and 0 interrupted iterations
name_update   [  51% ] 50 VUs  2m33.0s/5m0s

running (2m34.0s), 50/50 VUs, 111739 complete and 0 interrupted iterations
name_update   [  51% ] 50 VUs  2m34.0s/5m0s

running (2m35.0s), 50/50 VUs, 112508 complete and 0 interrupted iterations
name_update   [  52% ] 50 VUs  2m35.0s/5m0s

running (2m36.0s), 50/50 VUs, 113363 complete and 0 interrupted iterations
name_update   [  52% ] 50 VUs  2m36.0s/5m0s

running (2m37.0s), 50/50 VUs, 114194 complete and 0 interrupted iterations
name_update   [  52% ] 50 VUs  2m37.0s/5m0s

running (2m38.0s), 50/50 VUs, 115070 complete and 0 interrupted iterations
name_update   [  53% ] 50 VUs  2m38.0s/5m0s

running (2m39.0s), 50/50 VUs, 115849 complete and 0 interrupted iterations
name_update   [  53% ] 50 VUs  2m39.0s/5m0s

running (2m40.0s), 50/50 VUs, 116513 complete and 0 interrupted iterations
name_update   [  53% ] 50 VUs  2m40.0s/5m0s

running (2m41.0s), 50/50 VUs, 117276 complete and 0 interrupted iterations
name_update   [  54% ] 50 VUs  2m41.0s/5m0s

running (2m42.0s), 50/50 VUs, 118090 complete and 0 interrupted iterations
name_update   [  54% ] 50 VUs  2m42.0s/5m0s

running (2m43.0s), 50/50 VUs, 118794 complete and 0 interrupted iterations
name_update   [  54% ] 50 VUs  2m43.0s/5m0s

running (2m44.0s), 50/50 VUs, 119627 complete and 0 interrupted iterations
name_update   [  55% ] 50 VUs  2m44.0s/5m0s

running (2m45.0s), 50/50 VUs, 120445 complete and 0 interrupted iterations
name_update   [  55% ] 50 VUs  2m45.0s/5m0s

running (2m46.0s), 50/50 VUs, 121201 complete and 0 interrupted iterations
name_update   [  55% ] 50 VUs  2m46.0s/5m0s

running (2m47.0s), 50/50 VUs, 121835 complete and 0 interrupted iterations
name_update   [  56% ] 50 VUs  2m47.0s/5m0s

running (2m48.0s), 50/50 VUs, 122632 complete and 0 interrupted iterations
name_update   [  56% ] 50 VUs  2m48.0s/5m0s

running (2m49.0s), 50/50 VUs, 123373 complete and 0 interrupted iterations
name_update   [  56% ] 50 VUs  2m49.0s/5m0s

running (2m50.0s), 50/50 VUs, 124137 complete and 0 interrupted iterations
name_update   [  57% ] 50 VUs  2m50.0s/5m0s

running (2m51.0s), 50/50 VUs, 124934 complete and 0 interrupted iterations
name_update   [  57% ] 50 VUs  2m51.0s/5m0s

running (2m52.0s), 50/50 VUs, 125618 complete and 0 interrupted iterations
name_update   [  57% ] 50 VUs  2m52.0s/5m0s

running (2m53.0s), 50/50 VUs, 126094 complete and 0 interrupted iterations
name_update   [  58% ] 50 VUs  2m53.0s/5m0s

running (2m54.0s), 50/50 VUs, 126892 complete and 0 interrupted iterations
name_update   [  58% ] 50 VUs  2m54.0s/5m0s

running (2m55.0s), 50/50 VUs, 127613 complete and 0 interrupted iterations
name_update   [  58% ] 50 VUs  2m55.0s/5m0s

running (2m56.0s), 50/50 VUs, 128396 complete and 0 interrupted iterations
name_update   [  59% ] 50 VUs  2m56.0s/5m0s

running (2m57.0s), 50/50 VUs, 129221 complete and 0 interrupted iterations
name_update   [  59% ] 50 VUs  2m57.0s/5m0s

running (2m58.0s), 50/50 VUs, 129895 complete and 0 interrupted iterations
name_update   [  59% ] 50 VUs  2m58.0s/5m0s

running (2m59.0s), 50/50 VUs, 130544 complete and 0 interrupted iterations
name_update   [  60% ] 50 VUs  2m59.0s/5m0s

running (3m00.0s), 50/50 VUs, 131167 complete and 0 interrupted iterations
name_update   [  60% ] 50 VUs  3m00.0s/5m0s

running (3m01.0s), 50/50 VUs, 131901 complete and 0 interrupted iterations
name_update   [  60% ] 50 VUs  3m01.0s/5m0s

running (3m02.0s), 50/50 VUs, 132613 complete and 0 interrupted iterations
name_update   [  61% ] 50 VUs  3m02.0s/5m0s

running (3m03.0s), 50/50 VUs, 133398 complete and 0 interrupted iterations
name_update   [  61% ] 50 VUs  3m03.0s/5m0s

running (3m04.0s), 50/50 VUs, 134135 complete and 0 interrupted iterations
name_update   [  61% ] 50 VUs  3m04.0s/5m0s

running (3m05.0s), 50/50 VUs, 134782 complete and 0 interrupted iterations
name_update   [  62% ] 50 VUs  3m05.0s/5m0s

running (3m06.0s), 50/50 VUs, 135560 complete and 0 interrupted iterations
name_update   [  62% ] 50 VUs  3m06.0s/5m0s

running (3m07.0s), 50/50 VUs, 136403 complete and 0 interrupted iterations
name_update   [  62% ] 50 VUs  3m07.0s/5m0s

running (3m08.0s), 50/50 VUs, 137233 complete and 0 interrupted iterations
name_update   [  63% ] 50 VUs  3m08.0s/5m0s

running (3m09.0s), 50/50 VUs, 138040 complete and 0 interrupted iterations
name_update   [  63% ] 50 VUs  3m09.0s/5m0s

running (3m10.0s), 50/50 VUs, 138846 complete and 0 interrupted iterations
name_update   [  63% ] 50 VUs  3m10.0s/5m0s

running (3m11.0s), 50/50 VUs, 139609 complete and 0 interrupted iterations
name_update   [  64% ] 50 VUs  3m11.0s/5m0s

running (3m12.0s), 50/50 VUs, 140324 complete and 0 interrupted iterations
name_update   [  64% ] 50 VUs  3m12.0s/5m0s

running (3m13.0s), 50/50 VUs, 141064 complete and 0 interrupted iterations
name_update   [  64% ] 50 VUs  3m13.0s/5m0s

running (3m14.0s), 50/50 VUs, 141810 complete and 0 interrupted iterations
name_update   [  65% ] 50 VUs  3m14.0s/5m0s

running (3m15.0s), 50/50 VUs, 142604 complete and 0 interrupted iterations
name_update   [  65% ] 50 VUs  3m15.0s/5m0s

running (3m16.0s), 50/50 VUs, 143381 complete and 0 interrupted iterations
name_update   [  65% ] 50 VUs  3m16.0s/5m0s

running (3m17.0s), 50/50 VUs, 144163 complete and 0 interrupted iterations
name_update   [  66% ] 50 VUs  3m17.0s/5m0s

running (3m18.0s), 50/50 VUs, 144481 complete and 0 interrupted iterations
name_update   [  66% ] 50 VUs  3m18.0s/5m0s

running (3m19.0s), 50/50 VUs, 144932 complete and 0 interrupted iterations
name_update   [  66% ] 50 VUs  3m19.0s/5m0s

running (3m20.0s), 50/50 VUs, 145780 complete and 0 interrupted iterations
name_update   [  67% ] 50 VUs  3m20.0s/5m0s

running (3m21.0s), 50/50 VUs, 146575 complete and 0 interrupted iterations
name_update   [  67% ] 50 VUs  3m21.0s/5m0s

running (3m22.0s), 50/50 VUs, 147350 complete and 0 interrupted iterations
name_update   [  67% ] 50 VUs  3m22.0s/5m0s

running (3m23.0s), 50/50 VUs, 148197 complete and 0 interrupted iterations
name_update   [  68% ] 50 VUs  3m23.0s/5m0s

running (3m24.0s), 50/50 VUs, 148909 complete and 0 interrupted iterations
name_update   [  68% ] 50 VUs  3m24.0s/5m0s

running (3m25.0s), 50/50 VUs, 149682 complete and 0 interrupted iterations
name_update   [  68% ] 50 VUs  3m25.0s/5m0s

running (3m26.0s), 50/50 VUs, 150544 complete and 0 interrupted iterations
name_update   [  69% ] 50 VUs  3m26.0s/5m0s

running (3m27.0s), 50/50 VUs, 151371 complete and 0 interrupted iterations
name_update   [  69% ] 50 VUs  3m27.0s/5m0s

running (3m28.0s), 50/50 VUs, 152175 complete and 0 interrupted iterations
name_update   [  69% ] 50 VUs  3m28.0s/5m0s

running (3m29.0s), 50/50 VUs, 152942 complete and 0 interrupted iterations
name_update   [  70% ] 50 VUs  3m29.0s/5m0s

running (3m30.0s), 50/50 VUs, 153771 complete and 0 interrupted iterations
name_update   [  70% ] 50 VUs  3m30.0s/5m0s

running (3m31.0s), 50/50 VUs, 154485 complete and 0 interrupted iterations
name_update   [  70% ] 50 VUs  3m31.0s/5m0s

running (3m32.0s), 50/50 VUs, 155323 complete and 0 interrupted iterations
name_update   [  71% ] 50 VUs  3m32.0s/5m0s

running (3m33.0s), 50/50 VUs, 156173 complete and 0 interrupted iterations
name_update   [  71% ] 50 VUs  3m33.0s/5m0s

running (3m34.0s), 50/50 VUs, 156961 complete and 0 interrupted iterations
name_update   [  71% ] 50 VUs  3m34.0s/5m0s

running (3m35.0s), 50/50 VUs, 157810 complete and 0 interrupted iterations
name_update   [  72% ] 50 VUs  3m35.0s/5m0s

running (3m36.0s), 50/50 VUs, 158629 complete and 0 interrupted iterations
name_update   [  72% ] 50 VUs  3m36.0s/5m0s

running (3m37.0s), 50/50 VUs, 159308 complete and 0 interrupted iterations
name_update   [  72% ] 50 VUs  3m37.0s/5m0s

running (3m38.0s), 50/50 VUs, 160132 complete and 0 interrupted iterations
name_update   [  73% ] 50 VUs  3m38.0s/5m0s

running (3m39.0s), 50/50 VUs, 160987 complete and 0 interrupted iterations
name_update   [  73% ] 50 VUs  3m39.0s/5m0s

running (3m40.0s), 50/50 VUs, 161781 complete and 0 interrupted iterations
name_update   [  73% ] 50 VUs  3m40.0s/5m0s

running (3m41.0s), 50/50 VUs, 162603 complete and 0 interrupted iterations
name_update   [  74% ] 50 VUs  3m41.0s/5m0s

running (3m42.0s), 50/50 VUs, 163450 complete and 0 interrupted iterations
name_update   [  74% ] 50 VUs  3m42.0s/5m0s

running (3m43.0s), 50/50 VUs, 164149 complete and 0 interrupted iterations
name_update   [  74% ] 50 VUs  3m43.0s/5m0s

running (3m44.0s), 50/50 VUs, 164912 complete and 0 interrupted iterations
name_update   [  75% ] 50 VUs  3m44.0s/5m0s

running (3m45.0s), 50/50 VUs, 165774 complete and 0 interrupted iterations
name_update   [  75% ] 50 VUs  3m45.0s/5m0s

running (3m46.0s), 50/50 VUs, 166593 complete and 0 interrupted iterations
name_update   [  75% ] 50 VUs  3m46.0s/5m0s

running (3m47.0s), 50/50 VUs, 167396 complete and 0 interrupted iterations
name_update   [  76% ] 50 VUs  3m47.0s/5m0s

running (3m48.0s), 50/50 VUs, 168147 complete and 0 interrupted iterations
name_update   [  76% ] 50 VUs  3m48.0s/5m0s

running (3m49.0s), 50/50 VUs, 168919 complete and 0 interrupted iterations
name_update   [  76% ] 50 VUs  3m49.0s/5m0s

running (3m50.0s), 50/50 VUs, 169641 complete and 0 interrupted iterations
name_update   [  77% ] 50 VUs  3m50.0s/5m0s

running (3m51.0s), 50/50 VUs, 170469 complete and 0 interrupted iterations
name_update   [  77% ] 50 VUs  3m51.0s/5m0s

running (3m52.0s), 50/50 VUs, 171321 complete and 0 interrupted iterations
name_update   [  77% ] 50 VUs  3m52.0s/5m0s

running (3m53.0s), 50/50 VUs, 172083 complete and 0 interrupted iterations
name_update   [  78% ] 50 VUs  3m53.0s/5m0s

running (3m54.0s), 50/50 VUs, 172931 complete and 0 interrupted iterations
name_update   [  78% ] 50 VUs  3m54.0s/5m0s

running (3m55.0s), 50/50 VUs, 173687 complete and 0 interrupted iterations
name_update   [  78% ] 50 VUs  3m55.0s/5m0s

running (3m56.0s), 50/50 VUs, 174341 complete and 0 interrupted iterations
name_update   [  79% ] 50 VUs  3m56.0s/5m0s

running (3m57.0s), 50/50 VUs, 175141 complete and 0 interrupted iterations
name_update   [  79% ] 50 VUs  3m57.0s/5m0s

running (3m58.0s), 50/50 VUs, 175935 complete and 0 interrupted iterations
name_update   [  79% ] 50 VUs  3m58.0s/5m0s

running (3m59.0s), 50/50 VUs, 176718 complete and 0 interrupted iterations
name_update   [  80% ] 50 VUs  3m59.0s/5m0s

running (4m00.0s), 50/50 VUs, 177385 complete and 0 interrupted iterations
name_update   [  80% ] 50 VUs  4m00.0s/5m0s

running (4m01.0s), 50/50 VUs, 177923 complete and 0 interrupted iterations
name_update   [  80% ] 50 VUs  4m01.0s/5m0s

running (4m02.0s), 50/50 VUs, 178665 complete and 0 interrupted iterations
name_update   [  81% ] 50 VUs  4m02.0s/5m0s

running (4m03.0s), 50/50 VUs, 179343 complete and 0 interrupted iterations
name_update   [  81% ] 50 VUs  4m03.0s/5m0s

running (4m04.0s), 50/50 VUs, 180128 complete and 0 interrupted iterations
name_update   [  81% ] 50 VUs  4m04.0s/5m0s

running (4m05.0s), 50/50 VUs, 180945 complete and 0 interrupted iterations
name_update   [  82% ] 50 VUs  4m05.0s/5m0s

running (4m06.0s), 50/50 VUs, 181791 complete and 0 interrupted iterations
name_update   [  82% ] 50 VUs  4m06.0s/5m0s

running (4m07.0s), 50/50 VUs, 182625 complete and 0 interrupted iterations
name_update   [  82% ] 50 VUs  4m07.0s/5m0s

running (4m08.0s), 50/50 VUs, 183467 complete and 0 interrupted iterations
name_update   [  83% ] 50 VUs  4m08.0s/5m0s

running (4m09.0s), 50/50 VUs, 184012 complete and 0 interrupted iterations
name_update   [  83% ] 50 VUs  4m09.0s/5m0s

running (4m10.0s), 50/50 VUs, 184825 complete and 0 interrupted iterations
name_update   [  83% ] 50 VUs  4m10.0s/5m0s

running (4m11.0s), 50/50 VUs, 185618 complete and 0 interrupted iterations
name_update   [  84% ] 50 VUs  4m11.0s/5m0s

running (4m12.0s), 50/50 VUs, 186430 complete and 0 interrupted iterations
name_update   [  84% ] 50 VUs  4m12.0s/5m0s

running (4m13.0s), 50/50 VUs, 187238 complete and 0 interrupted iterations
name_update   [  84% ] 50 VUs  4m13.0s/5m0s

running (4m14.0s), 50/50 VUs, 187976 complete and 0 interrupted iterations
name_update   [  85% ] 50 VUs  4m14.0s/5m0s

running (4m15.0s), 50/50 VUs, 188742 complete and 0 interrupted iterations
name_update   [  85% ] 50 VUs  4m15.0s/5m0s

running (4m16.0s), 50/50 VUs, 189470 complete and 0 interrupted iterations
name_update   [  85% ] 50 VUs  4m16.0s/5m0s

running (4m17.0s), 50/50 VUs, 190200 complete and 0 interrupted iterations
name_update   [  86% ] 50 VUs  4m17.0s/5m0s

running (4m18.0s), 50/50 VUs, 191038 complete and 0 interrupted iterations
name_update   [  86% ] 50 VUs  4m18.0s/5m0s

running (4m19.0s), 50/50 VUs, 191802 complete and 0 interrupted iterations
name_update   [  86% ] 50 VUs  4m19.0s/5m0s

running (4m20.0s), 50/50 VUs, 192588 complete and 0 interrupted iterations
name_update   [  87% ] 50 VUs  4m20.0s/5m0s

running (4m21.0s), 50/50 VUs, 193364 complete and 0 interrupted iterations
name_update   [  87% ] 50 VUs  4m21.0s/5m0s

running (4m22.0s), 50/50 VUs, 194022 complete and 0 interrupted iterations
name_update   [  87% ] 50 VUs  4m22.0s/5m0s

running (4m23.0s), 50/50 VUs, 194752 complete and 0 interrupted iterations
name_update   [  88% ] 50 VUs  4m23.0s/5m0s

running (4m24.0s), 50/50 VUs, 195517 complete and 0 interrupted iterations
name_update   [  88% ] 50 VUs  4m24.0s/5m0s

running (4m25.0s), 50/50 VUs, 196318 complete and 0 interrupted iterations
name_update   [  88% ] 50 VUs  4m25.0s/5m0s

running (4m26.0s), 50/50 VUs, 197120 complete and 0 interrupted iterations
name_update   [  89% ] 50 VUs  4m26.0s/5m0s

running (4m27.0s), 50/50 VUs, 197942 complete and 0 interrupted iterations
name_update   [  89% ] 50 VUs  4m27.0s/5m0s

running (4m28.0s), 50/50 VUs, 198598 complete and 0 interrupted iterations
name_update   [  89% ] 50 VUs  4m28.0s/5m0s

running (4m29.0s), 50/50 VUs, 199363 complete and 0 interrupted iterations
name_update   [  90% ] 50 VUs  4m29.0s/5m0s

running (4m30.0s), 50/50 VUs, 200156 complete and 0 interrupted iterations
name_update   [  90% ] 50 VUs  4m30.0s/5m0s

running (4m31.0s), 50/50 VUs, 201015 complete and 0 interrupted iterations
name_update   [  90% ] 50 VUs  4m31.0s/5m0s

running (4m32.0s), 50/50 VUs, 201803 complete and 0 interrupted iterations
name_update   [  91% ] 50 VUs  4m32.0s/5m0s

running (4m33.0s), 50/50 VUs, 202611 complete and 0 interrupted iterations
name_update   [  91% ] 50 VUs  4m33.0s/5m0s

running (4m34.0s), 50/50 VUs, 203294 complete and 0 interrupted iterations
name_update   [  91% ] 50 VUs  4m34.0s/5m0s

running (4m35.0s), 50/50 VUs, 204027 complete and 0 interrupted iterations
name_update   [  92% ] 50 VUs  4m35.0s/5m0s

running (4m36.0s), 50/50 VUs, 204846 complete and 0 interrupted iterations
name_update   [  92% ] 50 VUs  4m36.0s/5m0s

running (4m37.0s), 50/50 VUs, 205662 complete and 0 interrupted iterations
name_update   [  92% ] 50 VUs  4m37.0s/5m0s

running (4m38.0s), 50/50 VUs, 206484 complete and 0 interrupted iterations
name_update   [  93% ] 50 VUs  4m38.0s/5m0s

running (4m39.0s), 50/50 VUs, 207255 complete and 0 interrupted iterations
name_update   [  93% ] 50 VUs  4m39.0s/5m0s

running (4m40.0s), 50/50 VUs, 208032 complete and 0 interrupted iterations
name_update   [  93% ] 50 VUs  4m40.0s/5m0s

running (4m41.0s), 50/50 VUs, 208760 complete and 0 interrupted iterations
name_update   [  94% ] 50 VUs  4m41.0s/5m0s

running (4m42.0s), 50/50 VUs, 209524 complete and 0 interrupted iterations
name_update   [  94% ] 50 VUs  4m42.0s/5m0s

running (4m43.0s), 50/50 VUs, 210312 complete and 0 interrupted iterations
name_update   [  94% ] 50 VUs  4m43.0s/5m0s

running (4m44.0s), 50/50 VUs, 211105 complete and 0 interrupted iterations
name_update   [  95% ] 50 VUs  4m44.0s/5m0s

running (4m45.0s), 50/50 VUs, 211872 complete and 0 interrupted iterations
name_update   [  95% ] 50 VUs  4m45.0s/5m0s

running (4m46.0s), 50/50 VUs, 212706 complete and 0 interrupted iterations
name_update   [  95% ] 50 VUs  4m46.0s/5m0s

running (4m47.0s), 50/50 VUs, 213313 complete and 0 interrupted iterations
name_update   [  96% ] 50 VUs  4m47.0s/5m0s

running (4m48.0s), 50/50 VUs, 214074 complete and 0 interrupted iterations
name_update   [  96% ] 50 VUs  4m48.0s/5m0s

running (4m49.0s), 50/50 VUs, 214662 complete and 0 interrupted iterations
name_update   [  96% ] 50 VUs  4m49.0s/5m0s

running (4m50.0s), 50/50 VUs, 215444 complete and 0 interrupted iterations
name_update   [  97% ] 50 VUs  4m50.0s/5m0s

running (4m51.0s), 50/50 VUs, 216275 complete and 0 interrupted iterations
name_update   [  97% ] 50 VUs  4m51.0s/5m0s

running (4m52.0s), 50/50 VUs, 216814 complete and 0 interrupted iterations
name_update   [  97% ] 50 VUs  4m52.0s/5m0s

running (4m53.0s), 50/50 VUs, 217586 complete and 0 interrupted iterations
name_update   [  98% ] 50 VUs  4m53.0s/5m0s

running (4m54.0s), 50/50 VUs, 218366 complete and 0 interrupted iterations
name_update   [  98% ] 50 VUs  4m54.0s/5m0s

running (4m55.0s), 50/50 VUs, 219096 complete and 0 interrupted iterations
name_update   [  98% ] 50 VUs  4m55.0s/5m0s

running (4m56.0s), 50/50 VUs, 219799 complete and 0 interrupted iterations
name_update   [  99% ] 50 VUs  4m56.0s/5m0s

running (4m57.0s), 50/50 VUs, 220650 complete and 0 interrupted iterations
name_update   [  99% ] 50 VUs  4m57.0s/5m0s

running (4m58.0s), 50/50 VUs, 221447 complete and 0 interrupted iterations
name_update   [  99% ] 50 VUs  4m58.0s/5m0s

running (4m59.0s), 50/50 VUs, 222188 complete and 0 interrupted iterations
name_update   [ 100% ] 50 VUs  4m59.0s/5m0s

running (5m00.0s), 50/50 VUs, 222764 complete and 0 interrupted iterations
name_update   [ 100% ] 50 VUs  5m00.0s/5m0s
      ✓ status 200

      checks.........................: 100.00% ✓ 222833     ✗ 0     
      data_received..................: 55 MB   182 kB/s
      data_sent......................: 44 MB   148 kB/s
      http_req_blocked...............: min=1.88µs  avg=10.25µs med=4.2µs   p(90)=5.52µs   p(95)=6.52µs   p(99)=46.34µs  max=23.21ms
      http_req_connecting............: min=0s      avg=1.86µs  med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=17.45ms
      http_req_duration..............: min=1.48ms  avg=15.89ms med=9.56ms  p(90)=29.54ms  p(95)=39.54ms  p(99)=93.88ms  max=1.89s  
        { expected_response:true }...: min=1.48ms  avg=15.89ms med=9.56ms  p(90)=29.54ms  p(95)=39.54ms  p(99)=93.88ms  max=1.89s  
      http_req_failed................: 0.00%   ✓ 0          ✗ 222833
      http_req_receiving.............: min=12.28µs avg=90.88µs med=39.36µs p(90)=212.48µs p(95)=268.68µs p(99)=753.76µs max=50.02ms
      http_req_sending...............: min=6.76µs  avg=93.25µs med=14.8µs  p(90)=134.28µs p(95)=303.36µs p(99)=1.39ms   max=75.57ms
      http_req_tls_handshaking.......: min=0s      avg=0s      med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=0s     
      http_req_waiting...............: min=1.43ms  avg=15.71ms med=9.39ms  p(90)=29.26ms  p(95)=39.26ms  p(99)=93.64ms  max=1.89s  
      http_reqs......................: 222833  742.582565/s
      iteration_duration.............: min=51.78ms avg=67.29ms med=60.79ms p(90)=81.73ms  p(95)=92.57ms  p(99)=148.42ms max=1.94s  
      iterations.....................: 222833  742.582565/s
    ✓ name_update_errors.............: 0.00%   ✓ 0          ✗ 222833
    ✓ name_update_latency_ms.........: min=1ms     avg=16.01ms med=10ms    p(90)=30ms     p(95)=40ms     p(99)=94ms     max=1.89s  
      vus............................: 50      min=50       max=50  
      vus_max........................: 50      min=50       max=50  
running (5m00.1s), 00/50 VUs, 222833 complete and 0 interrupted iterations
name_update ✓ [ 100% ] 50 VUs  5m0s